<template>
    <div class="flex flex-center text-white">
        <div class="div1">
            <h5>
                О приложении:
            </h5>
            <p>
                Всем привет! Это приложение - Планировщик , в нем вы можете запланировать свои задачи и сделать диаграмму
            </p>
            <h5>
                Функционал:
            </h5>
            <p>
                Чтобы создать заметку нажмите на кнопку "Создать заметку", в открывшемся поле введите поля(Пустые поля вызовут ошибку)<br>
                Чтобы создать диаграмму нажмите на кнопку "Создать диаграмму" , после чего выберете необходимый вид диаграммы<br>
                Чтобы добавить фотографию в блоке нужной вам заметки , нажмите на кнопку камеры , после чего введите туда ссылку на фото<br>
                Чтобы удалить заметку или диаграмму , нажмите на красный значок мусорки
            </p>
        </div>
    </div>
</template>

<script>
import { defineComponent } from 'vue'
export default defineComponent({})
</script>

<style scoped>
    .div1 {
        width: 30%;
    }
    @media  screen and (width < 1400px) {
        .div1 {
            width: 70%;
        }
    }
</style>